package printing;

public class PrintTest {

    public static void main(String[] args) {

        System.out.println("Hello World !");
        System.out.println("Am Anger, Willich, 47877");
        System.out.println("Podlesnaya Anastasiia, nisana@ukr.net, 002");
        System.out.println(" # < > + - , . : ; () {} / [] @  '' ^ & | % * ");
        System.out.println("Основные свойства алгоритма: \n" +
                "Определённость. Каждый шаг алгоритма должен быть чётко определён, без каких-либо двусмысленностей.\n" +
                "Конечность. Алгоритм должен завершиться  после конечного числа шагов. Это не означает, что алгоритм короткий, но гарантирует, что он не будет выполняться вечно.\n" +
                "Массовость. Алгоритм должен быть применим к широкому классу задач, а не только к одной конкретной задаче.\n" +
                "Результативность. После завершения алгоритма нужно получить результат, который соответствует цели, для которой алгоритм был разработан.\n" +
                "Эффективность. Хотя это свойство не является обязательным, хорошие алгоритмы обычно оптимизированы таким образом, чтобы они были как можно более эффективными в плане использования ресурсов и времени выполнения.");



                                           }


                       }
